#language: ru

@tree

Функционал: создание документа Заказ поставщика

Как Менеджер по закупкам я хочу
создание документа заказ поставщика
чтобы поставить товар на учет  


Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: создание документа заказ поставщика
// создание документа Заказ поставщику
//новое
И я закрываю все окна клиентского приложения
* Открытие формы создания документа
 И В командном интерфейсе я выбираю "Закупки" "Заказы поставщикам"
 И Я жду открытия окна "Заказы поставщикам" в течение 30 секунд
* Заполнение шапки документа
 Тогда открылось окно "Заказы поставщикам"
 И в таблице 'Список' я нажимаю на кнопку с именем 'СписокСоздать'
 Тогда открылось окно "Заказ поставщику (создание)"
 И из выпадающего списка с именем 'Партнер' я выбираю точное значение "Дымов"
 И я нажимаю кнопку выбора у поля с именем 'Склад'
 Тогда открылось окно "Склады и магазины"
 И в таблице 'Список' я активизирую дополнение формы с именем 'СписокСтрокаПоиска'
 И в таблице 'Список' в дополнение формы с именем 'СписокСтрокаПоиска' я ввожу текст "проф"
 И в таблице 'Список' я перехожу к строке:
	| "Наименование"                         |
	| "3PL <b><colorstyle -46>Проф</></>реш" |
 И в таблице 'Список' я выбираю текущую строку
 Тогда элемент формы с именем 'Склад' стал равен "3PL Профреш" 
 Тогда открылось окно "Заказ поставщику (создание) *"
* Заполнение товарной части
 И я перехожу к закладке с именем 'ГруппаТовары'
 И в таблице 'Товары' я нажимаю на кнопку с именем 'ТоварыДобавить'
 И в таблице 'Товары' из выпадающего списка с именем 'ТоварыНоменклатураПоставщика' я выбираю по строке "колбаса"
 И в таблице 'Товары' я завершаю редактирование строки
 И в таблице 'Товары' я выбираю текущую строку
 И в таблице 'Товары' я выбираю текущую строку
И в таблице 'Товары' из выпадающего списка с именем 'ТоварыНоменклатураПоставщика' я выбираю по строке "кол"
И в таблице 'Товары' я активизирую поле с именем 'ТоварыКоличествоУпаковок'
И в таблице 'Товары' в поле с именем 'ТоварыКоличествоУпаковок' я ввожу текст "10,000"
И в таблице 'Товары' я завершаю редактирование строки
 И в таблице 'Товары' в поле с именем 'ТоварыЦена' я ввожу текст "100,00"
 И в таблице 'Товары' я нажимаю на кнопку с именем 'ТоварыДобавить'
 И в таблице 'Товары' из выпадающего списка с именем 'ТоварыНоменклатураПоставщика' я выбираю по строке "колбаса"
 И в таблице 'Товары' я завершаю редактирование строки
 И в таблице 'Товары' я выбираю текущую строку
 И в таблице 'Товары' в поле с именем 'ТоварыЦена' я ввожу текст "100,00"
 И в таблице 'Товары' я завершаю редактирование строки
 И в таблице 'Товары' я выбираю текущую строку
 И в таблице 'Товары' из выпадающего списка с именем 'ТоварыНоменклатураПоставщика' я выбираю по строке "кол"
 И в таблице 'Товары' я активизирую поле с именем 'ТоварыКоличествоУпаковок'
 И в таблице 'Товары' в поле с именем 'ТоварыКоличествоУпаковок' я ввожу текст "10,000"
 И в таблице 'Товары' я завершаю редактирование строки
 И в таблице 'Товары' я выбираю текущую строку
 И в таблице 'Товары' в поле с именем 'ТоварыЦена' я ввожу текст "100,00"
 И в таблице 'Товары' я завершаю редактирование строки
* Проверка табличной части
	Тогда таблица 'Товары' содержит строки:
		| 'N' | 'Номенклатура поставщика'                           | 'Артикул (ЯЛ)' | 'Номенклатура'                                     | 'Количество' | 'Цена'   | 'Сумма'    | 'Ставка НДС' | 'НДС'    | 'Сумма с НДС' |
		| '*' | 'Колбаса сырокопчёная «Австрийская» «Дымов», 230 г' | '10004181'     | 'Колбаса Австрийская «Дымов» сырокопчёная, 230 гг' | '20,000'     | '100,00' | '1 000,00' | '10%'        | '100,00' | '1 100,00'    |
		| '*' | 'Колбаса сырокопчёная «Австрийская» «Дымов», 230 г' | '10004181'     | 'Колбаса Австрийская «Дымов» сырокопчёная, 230 гг' | '10,000'     | '100,00' | '1 000,00' | '10%'        | '100,00' | '1 100,00'    |
* Номер
 И я запоминаю значение поля "Номер" как "$Номер$"
* Проведение документа
 И я нажимаю на кнопку с именем 'ФормаПровести'
 И я нажимаю на кнопку "Записать"
 И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
 Сценарий: проверка наличия в справочнике номенклатуры "Колбаса Австрийская «Дымов» сырокопчёная, 230 гг"
 И В командном интерфейсе я выбираю "НСИ и администрирование" "Номенклатура"
 Тогда открылось окно "Номенклатура"
 И из выпадающего списка с именем 'СтрокаПоискаНоменклатура' я выбираю по строке "Колбаса Австрийская «Дымов» сырокопчёная, 230 гг"
 И в таблице 'СписокРасширенныйПоискНоменклатура' я выбираю текущую строку
 
 
 
 